# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [4]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [5]:
# your answer here
employee = pd.read_csv("Employee.csv")
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [6]:
# Method 1
# your answer here
employee.groupby(['Department']).agg({'Salary':'mean'}).reset_index()
df = employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary':'mean'}).reset_index()
df.head()

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [8]:
# Method 2
# your answer here
df = employee.pivot_table(index= ['Department','Title'], values = ['Salary'], aggfunc = {'Salary':'mean'}).reset_index()
df.head()

  Department      Title  Salary
0         HR         VP    70.0
1         HR    analyst    32.5
2         IT         VP    70.0
3         IT    analyst    32.5
4         IT  associate    60.0

In [ ]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [11]:
# your answer here
df = employee.pivot_table(index= ['Title'], values = ['Salary','Years'], aggfunc = {'Salary':'sum', 'Years':'sum'}).reset_index()
df.head()

       Title  Salary  Years
0         VP     140     16
1    analyst     130      9
2  associate     170     12

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [22]:
# your answer here
df = employee.pivot_table(index= ['Department','Title'], values = ['Salary','Name'], aggfunc = {'Salary':'mean', 'Name':'count'}).reset_index()
df.columns = ['Department', 'Title','Number of employees', 'Mean Salary']
df.head()

  Department      Title  Number of employees  Mean Salary
0         HR         VP                    1         70.0
1         HR    analyst                    2         32.5
2         IT         VP                    1         70.0
3         IT    analyst                    2         32.5
4         IT  associate                    1         60.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [14]:
# your answer here
df = employee.pivot_table(index= ['Department','Title'], values = ['Salary','Name'], aggfunc = {'Salary':['median','min','max','std']}).reset_index()
df.head()
# for some salaries there are no variations, std 0 since there is no deviation from the mean.

  Department      Title Salary
                           max median min       std
0         HR         VP     70   70.0  70       NaN
1         HR    analyst     35   32.5  30  3.535534
2         IT         VP     70   70.0  70       NaN
3         IT    analyst     35   32.5  30  3.535534
4         IT  associate     60   60.0  60       NaN

#### Based on your comments, fill the missing values with an appropriate value.

In [18]:
# your answer here
df['Salary', 'std'] = df['Salary', 'std'].fillna(0)
df.head()

  Department      Title Salary
                           max median min       std
0         HR         VP     70   70.0  70  0.000000
1         HR    analyst     35   32.5  30  3.535534
2         IT         VP     70   70.0  70  0.000000
3         IT    analyst     35   32.5  30  3.535534
4         IT  associate     60   60.0  60  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [19]:
# your answer here
df = employee.pivot_table(index= ['Department'], values = ['Salary','Name'], aggfunc = {'Salary':'sum', 'Name':'count'}).reset_index()
df.head()

  Department  Name  Salary
0         HR     3     135
1         IT     4     195
2      Sales     2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [21]:
# your answer here
df = employee.pivot_table(index= ['Department','Title'], values = ['Salary','Years'], aggfunc = {'Salary':'mean', 'Years':'sum'}).reset_index()
df.head()

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [26]:
# Custom function to calculate mean after removing max
def mean_without_max(x):
    return np.mean(x[x < x.max()])

# Create the pivot table
df_mean_salary = employee.pivot_table(index='Department', values='Salary', aggfunc=mean_without_max).reset_index()

# Rename the columns
df_mean_salary.columns = ['Department', 'Mean Salary (without max)']

df_mean_salary

  Department  Mean Salary (without max)
0         HR                  32.500000
1         IT                  41.666667